-- Вставка общих слов в таблицу Words
INSERT INTO Words (word_en, word_ru, category) VALUES
-- Цвета
('red', 'красный', 'цвет'),
('blue', 'синий', 'цвет'),
('green', 'зеленый', 'цвет'),
('yellow', 'желтый', 'цвет'),
('black', 'черный', 'цвет'),
('white', 'белый', 'цвет'),
('purple', 'фиолетовый', 'цвет'),
('orange', 'оранжевый', 'цвет'),
('pink', 'розовый', 'цвет'),
('brown', 'коричневый', 'цвет'),

-- Местоимения
('I', 'я', 'местоимение'),
('you', 'ты', 'местоимение'),
('he', 'он', 'местоимение'),
('she', 'она', 'местоимение'),
('we', 'мы', 'местоимение'),
('they', 'они', 'местоимение'),
('it', 'это', 'местоимение'),
('my', 'мой', 'местоимение'),
('your', 'твой', 'местоимение'),
('our', 'наш', 'местоимение'),

-- Животные
('dog', 'собака', 'животные'),
('cat', 'кошка', 'животные'),
('bird', 'птица', 'животные'),
('fish', 'рыба', 'животные'),
('horse', 'лошадь', 'животные'),
('cow', 'корова', 'животные'),
('sheep', 'овца', 'животные'),
('pig', 'свинья', 'животные'),
('rabbit', 'кролик', 'животные'),
('lion', 'лев', 'животные'),

-- Фрукты
('apple', 'яблоко', 'фрукты'),
('banana', 'банан', 'фрукты'),
('orange', 'апельсин', 'фрукты'),
('grape', 'виноград', 'фрукты'),
('lemon', 'лимон', 'фрукты'),
('peach', 'персик', 'фрукты'),
('pear', 'груша', 'фрукты'),
('pineapple', 'ананас', 'фрукты'),
('strawberry', 'клубника', 'фрукты'),
('watermelon', 'арбуз', 'фрукты'),

-- Овощи
('carrot', 'морковь', 'овощи'),
('potato', 'картофель', 'овощи'),
('tomato', 'помидор', 'овощи'),
('cucumber', 'огурец', 'овощи'),
('onion', 'лук', 'овощи'),
('garlic', 'чеснок', 'овощи'),
('pepper', 'перец', 'овощи'),
('broccoli', 'брокколи', 'овощи'),
('cabbage', 'капуста', 'овощи'),
('lettuce', 'салат', 'овощи');
